Reports/КвартальныйОтчетПоЕдиномуНалогуФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>КвартальныйОтчетПоЕдиномуНалогуФизЛиц</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоРаботников1МесяцКвартала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоРаботников2МесяцКвартала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоРаботников3МесяцКвартала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платежка1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платежка2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платежка3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемВыручки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/КнигаДоходовРасходовПоЕдиномуНалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>КнигаДоходовРасходовПоЕдиномуНалогу</Name>
			<Comment>(Регл)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/КвартальныйОтчетПоЕдиномуНалогуФизЛиц/Ext/ObjectModule.bsl
// Следующие переменные хранят границы
// периода построения отчета
Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета  Экспорт;

Процедура Заполнить() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	ПлатежныйДокумент.Ссылка КАК Ссылка,
	|	ПлатежныйДокумент.Дата КАК Дата,
	|	ПлатежныйДокумент.Номер КАК Номер,
	|	ПлатежныйДокумент.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее КАК ПлатежныйДокумент
	|ГДЕ
	|	ПлатежныйДокумент.ПеречислениеЕдиногоНалога = ИСТИНА
	|	И ПлатежныйДокумент.Организация = &Организация
	|	И ПлатежныйДокумент.Оплачено = ИСТИНА
	|	И ПлатежныйДокумент.Дата >= &ДатаНачала
	|	И ПлатежныйДокумент.Дата <= &ДатаКонца
	|	И ПлатежныйДокумент.Проведен = ИСТИНА
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	ПлатежныйДокумент.Ссылка,
	|	ПлатежныйДокумент.Дата,
	|	ПлатежныйДокумент.Номер,
	|	ПлатежныйДокумент.СуммаДокумента 
	|ИЗ
	|	Документ.ПлатежныйОрдерСписаниеДенежныхСредств КАК ПлатежныйДокумент
	|ГДЕ
	|	ПлатежныйДокумент.ПеречислениеЕдиногоНалога = ИСТИНА
	|	И ПлатежныйДокумент.Организация = &Организация
	|	И ПлатежныйДокумент.Оплачено = ИСТИНА
	|	И ПлатежныйДокумент.Дата >= &ДатаНачала
	|	И ПлатежныйДокумент.Дата <= &ДатаКонца
	|	И ПлатежныйДокумент.Проведен = ИСТИНА
	//|ОБЪЕДИНИТЬ
	//|ВЫБРАТЬ
	//|	ПлатежныйДокумент.Ссылка,
	//|	ПлатежныйДокумент.ДатаВходящегоДокумента,
	//|	ПлатежныйДокумент.НомерВходящегоДокумента,
	//|	ПлатежныйДокумент.СуммаДокумента 
	//|ИЗ
	//|	Документ.ПлатежноеТребованиеПоручениеПолученное КАК ПлатежныйДокумент
	//|ГДЕ
	//|	ПлатежныйДокумент.ПеречислениеЕдиногоНалога = ИСТИНА
	//|	И ПлатежныйДокумент.Организация = &Организация
	//|	И ПлатежныйДокумент.Оплачено = ИСТИНА
	//|	И ПлатежныйДокумент.Дата >= &ДатаНачала
	//|	И ПлатежныйДокумент.Дата <= &ДатаКонца
	//|	И ПлатежныйДокумент.Проведен = ИСТИНА
	//|ОБЪЕДИНИТЬ
	//|ВЫБРАТЬ
	//|	ПлатежныйДокумент.Ссылка,
	//|	ПлатежныйДокумент.ДатаВходящегоДокумента,
	//|	ПлатежныйДокумент.НомерВходящегоДокумента,
	//|	ПлатежныйДокумент.СуммаДокумента 
	//|ИЗ
	//|	Документ.ПлатежноеТребованиеПолученное КАК ПлатежныйДокумент
	//|ГДЕ
	//|	ПлатежныйДокумент.ПеречислениеЕдиногоНалога = ИСТИНА
	//|	И ПлатежныйДокумент.Организация = &Организация
	//|	И ПлатежныйДокумент.Оплачено = ИСТИНА
	//|	И ПлатежныйДокумент.Дата >= &ДатаНачала
	//|	И ПлатежныйДокумент.Дата <= &ДатаКонца
	//|	И ПлатежныйДокумент.Проведен = ИСТИНА
	|УПОРЯДОЧИТЬ ПО Дата
	|";
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ДатаНачала",НачалоКвартала(мДатаНачалаПериодаОтчета));
	Запрос.УстановитьПараметр("ДатаКонца",КонецКвартала(мДатаКонцаПериодаОтчета));
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Индекс = 0;
	ВсегоНалога = 0;
	Пока Выборка.Следующий() Цикл
		
		ТипДокумента = ТипЗнч(Выборка.Ссылка);
		ТипДокументаТекст = "ПД"; //Платіжне доручення
		
		//Если Выборка = Тип("ДокументСсылка.ПлатежноеТребованиеПоручениеПолученное") Тогда
		//	
		//	ТипДокументаТекст = "ПВД"; //Платіжна вимога доручення
		//	
		//ИначеЕсли Выборка = Тип("ДокументСсылка.ПлатежноеТребованиеПолученное") Тогда
		//	
		//	ТипДокументаТекст = "ПВ"; //Платіжна вимога
		//	
		//КонецЕсли; 
		
		Индекс = Индекс + 1;
		Если Индекс<=3 Тогда
			ЭтотОбъект["Платежка"+Число(Индекс)] = ТипДокументаТекст + " №"+Выборка.Номер+" від "+Формат(Выборка.Дата,"ДФ=дд.ММ.гггг");
		КонецЕсли; 
		Если Индекс>3 Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Платёжный документ ';uk='Платіжний документ '")+ТипДокументаТекст + " №"+Выборка.Номер+" від "+Формат(Выборка.Дата,"ДФ=дд.ММ.гггг")+НСтр("ru=' не учитывается в отчете, т.к. максимальное количество - 3.';uk=' не враховується у звіті, т. я. максимальна кількість - 3.'"));
		КонецЕсли;
		
		ВсегоНалога = ВсегоНалога +Выборка.СуммаДокумента;
	КонецЦикла; 
	
	// считаем объем реализации
	Запрос.Текст = 
	"ВЫБРАТЬ
	 |	КнигаДоходовРасходовПоЕдиномуНалогуОбороты.СуммаОборот
	 |ИЗ
	 |	РегистрНакопления.КнигаДоходовРасходовПоЕдиномуНалогу.Обороты(
	 |		&ДатаНачала, &ДатаКонца,,Организация = &Организация И Статья = &Статья) КАК КнигаДоходовРасходовПоЕдиномуНалогуОбороты
	 |";
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Статья",Справочники.СтатьиНалоговыхДеклараций.ЕН_Реализация);
	Запрос.УстановитьПараметр("ДатаНачала",НачалоГода(мДатаНачалаПериодаОтчета));
	Запрос.УстановитьПараметр("ДатаКонца",КонецКвартала(мДатаКонцаПериодаОтчета));
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОбъемВыручки = 0;
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.СуммаОборот) Тогда
			ОбъемВыручки = ОбъемВыручки + Выборка.СуммаОборот;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
